#include <stdio.h>

int main() {


	/*
	运算符
	1、算术运算符:+ - * / % ++ -- 
	2、赋值运算符:= += -= *= /= %= <<= >>= &= ^= |=
	3、逻辑运算符：&& || !
	4、三目运算符：?:
	5、取地址符:&
    */
	// 创建整型变量
    int a = 10;
    int b = 10.5; // 发生数据截断：先将小数点及所有的小数全部丢弃，然后把10赋值给变量b

   // 创建浮点型变量
    double c = 1.23;
    double d = 1; // 发生自动数据类型转换：先将整数1自动转换为小数1.0，然后将小数1.0赋值给变量d
    float e = 1.23f; // 给float型变量赋值，要在值的末尾加f或F进行标记

   // 创建字符型变量
    char f = 'a';
    char g = '?';
    char h = '1';
    char i = 65;// 发生自动数据类型转换：先将整数65自动转换为'A'，然后将'A'赋值给变量i

    double j = 5 + 1.23; // 发生自动数据类型转换：先将整数5自动转换为5.0，然后计算5.0+1.23，最后将计算结果赋值给变量j
    int k = 10 + 'a'; // 发生自动数据类型转换：先将'a'自动转换为97，然后计算10+97，最后将计算结果赋值给变量k
    int l = 'a' + 10 * 1.2; // 发生自动数据类型转换：10 -> 10.0 得到12.0  'a'+ 12.0  'a'->97->97.0   97.0+12.0 得到109.0 -> 109


    double m = 5.12;
    int n = (int)m; //发生强制类型转换：将变量m的值（double型）强制转换成int型，然后将结果赋值给变量n

    double o1 = 5 / 2; // 2.0
    double o2 = (double)5 / 2;  // 2.5 将整数5强制转换成5.0
    double o3 = 5 / (double)2; // 2.5   5.0/2.0  2.5

    int p = 5 - 2;

    int q = 6 % 2;

    int r = 6 ;
    int ab = 6;
    int ac = 6;
    int ad = 6;

    int s = r++;//自增运算符在后,先赋值再加一

    int t = ++ab;//自增运算符在前，先加一再赋值

    int u = ac--;//自减运算符在后，先赋值再减一

    int v = --ad;//自减运算符在前，先减一再赋值
	return 0;
}