
#include <stdint.h>

/*数组
概念：一批相同类型的数据的有序集合
声明格式：数据类型 数组名字[数据长度]

数据类型：指明数组中数据的类型
数组名字：给数组起个名字，遵循C语言变量的命名规则
数据长度：数组中数据的个数

在编程语言中，通常把数组中的数据成为元素
*/

int main() {
	//创建了一个长度为10的int型数组
    //该组只允许放入int型数据
	//该数组长度为10，只允许放入最多10个数据
	
	/*
	//静态初始化(完全）[]内是几，就定义多少个元素
	int a[10] = {1,2,3,4,5,6,7,8,9,10};
	double b[5] = {3.14,2.5,5.28,0.7,10.63};

	//静态初始化(部分）
	char c[4] = {'m','x'};
	int d[3] = {10};
	int e[6] = {0};
	double f[6] = {5.2,9.84};
	for(i = 0; i < 5; i++){
		printf("b[%d] = %lf\n", i, b[i]);
	}
	*/
	
	/*
	int a[10];
	//给数组赋值,动态初始化
	a[0] = 1;
	a[1] = 2;
	a[2] = 3;
	a[3] = 4;
	a[4] = 5;
	a[5] = 6;
	a[6] = 7;
	a[7] = 8;
	a[8] = 9;
	a[9] = 10;
	a[10] = 11;//数组越界错误
	*/

	
	/*定位数组中的元素
	索引：数据组中的每一个元素都有一个具体的位置号
	索引：取值范围：0 - 数组长度
	数组中第一个元素的索引为0。   
	*/

	/*
	printf("a[0] = %d\n",a[0]); //a[0]:数组a中的第1个元素
	printf("a[1] = %d\n",a[1]); //a[0]:数组a中的第1个元素
	printf("a[2] = %d\n",a[2]); //a[0]:数组a中的第1个元素
	printf("a[3] = %d\n",a[3]); //a[0]:数组a中的第1个元素
	printf("a[4] = %d\n",a[4]); //a[0]:数组a中的第1个元素
	printf("a[5] = %d\n",a[5]); //a[0]:数组a中的第1个元素
	printf("a[6] = %d\n",a[6]); //a[0]:数组a中的第1个元素
	printf("a[7] = %d\n",a[7]); //a[0]:数组a中的第1个元素
	printf("a[8] = %d\n",a[8]); //a[0]:数组a中的第1个元素
	printf("a[9] = %d\n",a[9]); //a[0]:数组a中的第1个元素
	*/

	/*
	//遍历数组中的所有元素
	int a[10] = {1,2,3,4,5,6,7,8,9,10};
	int i;
	for(i = 0; i < 10; i++){
		printf("a[i] = %d\n", i, a[i]);
	}
	*/

	// 学以致用  案例：求数组中元素的最值（最小值、最大值）、累加和、平均值 
	int a[10], sum = 0, i, min, max;
	double average;

	printf("请输入10个元素：");
	for(i = 0; i < 10; i++) {
		scanf("%d", &a[i]);
	}

	min = a[0];
	max = a[0]; 
	for(i = 0; i < 10; i++) {
		if(min > a[i]) {
			min = a[i];
		}

		if(max < a[i]) { 
			max = a[i];
		}

		sum += a[i];
	}

	average = (double)sum / 10;

	printf("数组a中最小元素的值为：%d\n", min);
	printf("数组a中最大元素的值为：%d\n", max);
	printf("数组a中所有元素的累加和为：%d\n", sum);
	printf("数组a中所有元素的平均值为：%0.1f\n", average);

	/*
	二维数组：可以将二维数组看做一个M行N列的表格
	
	数组类型 数组名字[m][n]

	索引：元素在数组中的位置号

	注意：1、二维数组的索引有行索引和列索引构成
		  2、行索引、列索引都是从零开始


	//动态初始化
	int a[5][4];//创建了一个5行4列的整型数组a
	
	//静态初始化：创建二维数组的时候就赋值
	//             第一行  第二行  第三行
	int b[3][3] = {{1,2,3},{4,5,6},{7,8,9}};//完全初始化

	int c[2][3] = {{1},{3}};//部分初始化

	a[0][0] = 2;
	a[2][2] = 66;
	a[4][3] = 1000;
	printf("%d\n",a[2][2]);
	printf("%d\n",a[4][3]);
	printf("%d\n",b[2][1]);
	printf("%d\n",c[1][0]);

	*/


	/* 案例1：
	   定义一个2行3列的二维数组，
	   从键盘上输入6个数值，依次给该二维数组的每个元素赋值，按每行3个元素输出该二维数组及所有元素的和
	
	int a[2][3], i, j, sum = 0;
	
	printf("请输入6个整数：");
	for(i = 0; i < 2; i++) { //控制行
		for(j = 0; j < 3; j++) { //控制列
			scanf("%d", &a[i][j]);
		}
	}

	printf("输出该二维数组中每一行中的所有元素：\n");
	for(i = 0; i < 2; i++) {
		printf("第%d行中所有元素：", i+1);
		for(j = 0; j < 3; j++) {
			printf("%d ", a[i][j]);
		}
		printf("\n");
	}

	for(i = 0; i < 2; i++) {
		for(j = 0; j < 3; j++) {
			sum += a[i][j];
		}
	}

	printf("该二维数组中所有元素的累加和为：%d", sum);
	
	*/

	/*案例2：
	有一个3*4的矩阵，要求编程求出其中的最大元素的值，以及其所在的行号和列号
	*/
	int b[3][4], i, j, max, row, col;
	
	printf("请输入12个整数：");
	for(i = 0; i < 3; i++) {
		for(j = 0; j < 4; j++) {
			scanf("%d", &b[i][j]);
		}
	}

	max = b[0][0];
	for(i = 0; i < 3; i++) {
		for(j = 0; j < 4; j++) {
			if(max < b[i][j]) {
				max = b[i][j];
				row = i;
				col = j;
			}
		}
	}


	return 0;
}